Revit 2024 API
RailingPlacementPosition Enumeration
 Railing placement position.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public enum RailingPlacementPosition
Visual Basic
Public Enumeration RailingPlacementPosition
Visual C++
public enum class RailingPlacementPosition
Members
Member name | Description
Undefined |  No railing placement.
Treads |  Places railing on treads.
Stringer |  Places railing on stringer.
See Also
Autodesk.Revit.DB.Architecture Namespace